#Conte√∫do extra

#Importando html

In [33]:
import pandas as pd

https://www.federalreserve.gov/releases/h3/current/default.htm

In [34]:
df_html = pd.read_html('https://www.federalreserve.gov/releases/h3/current/default.htm')

In [35]:
len(df_html)

3

In [36]:
df_html[0].head()

         Date  ...                                       Reserve balances maintained 4
         Date  ... Balances maintained that exceed the top of the penalty- free band 6
0     Month 7  ...                                            Month 7
1   Aug. 2019  ...                                            1373321
2  Sept. 2019  ...                                            1292273
3   Oct. 2019  ...                                            1333462
4   Nov. 2019  ...                                            1375085

[5 rows x 7 columns]

In [37]:
df_html[1].head()

         Date Reserves  ...               Monetary base
         Date  Total 1  ... Total balances maintained 6 Currency in circulation
0     Month 7  Month 7  ...                     Month 7                 Month 7
1   Aug. 2019  1586844  ...                     1520876                 1750502
2  Sept. 2019  1504805  ...                     1439771                 1762898
3   Oct. 2019  1547136  ...                     1481513                 1771294
4   Nov. 2019  1595222  ...                     1529341                 1786209

[5 rows x 9 columns]

In [38]:
df_html[2].head()

         Date  ... Nonborrowed reserves 2
         Date  ... Nonborrowed reserves 2
0     Month 3  ...                Month 3
1   Aug. 2019  ...                1586727
2  Sept. 2019  ...                1504704
3   Oct. 2019  ...                1547073
4   Nov. 2019  ...                1595196

[5 rows x 7 columns]

In [39]:
data = [1 , 2, 3, 4 ,5]
s = pd.Series(data)

In [40]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
index = ['Linha' + str(i) for i in range(5)]

In [42]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [43]:
s = pd.Series(data= data, index=index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [44]:
data = {'linha' + str(i) : i +1 for i in range(5)}
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [45]:
s = pd.Series(data)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [46]:
s1 = s+1
s1

linha0    2
linha1    3
linha2    4
linha3    5
linha4    6
dtype: int64

In [47]:
s2 = s + s1
s2

linha0     3
linha1     5
linha2     7
linha3     9
linha4    11
dtype: int64

##DataFrame

In [48]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [49]:
df1 = pd.DataFrame(data= data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
index = ['linha' + str(i) for i in range(3)]

In [51]:
df1 = pd.DataFrame(data=data, index=index)
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [52]:
columns = ['coluna' + str(i) for i in range(3)]

In [53]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [54]:
data = {'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
        'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
        'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}
}

In [55]:
data

{'coluna0': {'linha0': 1, 'linha1': 4, 'linha2': 7},
 'coluna1': {'linha0': 2, 'linha1': 5, 'linha2': 8},
 'coluna2': {'linha0': 3, 'linha1': 6, 'linha2': 9}}

In [56]:
df2 = pd.DataFrame(data=data)
df2

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [57]:
data = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [58]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [59]:
df1[df1 > 0] = 'A'
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [60]:
df2[df2 > 0] = 'B'
df2

       coluna0 coluna1 coluna2
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B

In [61]:
df3[df3 > 0] = 'C'
df3

       coluna0 coluna1 coluna2
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [62]:
df4 = pd.concat([df1, df2, df3])
df4

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [63]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

       coluna0 coluna1 coluna2 coluna0 coluna1 coluna2 coluna0 coluna1 coluna2
linha0       A       A       A       B       B       B       C       C       C
linha1       A       A       A       B       B       B       C       C       C
linha2       A       A       A       B       B       B       C       C       C

##Organizando Dataframe

In [64]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [65]:
list('321')

['3', '2', '1']

In [66]:
df = pd.DataFrame(data, list('321'),  list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [67]:
df.sort_index(inplace=True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [68]:
df.sort_index(inplace=True, axis=1)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [69]:
df.sort_values(by='x', inplace=True)
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [70]:
df.sort_values(by='3', axis=1, inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [71]:
df.sort_values(by=['x', 'y'], inplace=True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

#Formas de sele√ß√£o

In [72]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [73]:
df['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [74]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [75]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [76]:
df[1:3][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   9

In [77]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [78]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [79]:
df.loc['l1', 'c2']

2

In [80]:
df.iloc[0 , 1]

2

In [81]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [82]:
df.iloc[[2, 0], [3,  0]]

    c4  c1
l3  12   9
l1   4   1

##M√©todos de interpola√ß√£o

In [83]:
data = [0.5, None, None, 0.52, 0.54, None, None, 0.59, 0.6, None, 0.7]
s = pd.Series(data)

In [84]:
s

0     0.50
1      NaN
2      NaN
3     0.52
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [85]:
s.fillna(0)

0     0.50
1     0.00
2     0.00
3     0.52
4     0.54
5     0.00
6     0.00
7     0.59
8     0.60
9     0.00
10    0.70
dtype: float64

In [86]:
s.fillna(method='ffill')

0     0.50
1     0.50
2     0.50
3     0.52
4     0.54
5     0.54
6     0.54
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [87]:
s.fillna(method='bfill')

0     0.50
1     0.52
2     0.52
3     0.52
4     0.54
5     0.59
6     0.59
7     0.59
8     0.60
9     0.70
10    0.70
dtype: float64

In [88]:
s.fillna(s.mean())

0     0.500
1     0.575
2     0.575
3     0.520
4     0.540
5     0.575
6     0.575
7     0.590
8     0.600
9     0.575
10    0.700
dtype: float64

In [89]:
s_1 = s.fillna(method='ffill', limit=1, )

In [90]:
s_1

0     0.50
1     0.50
2      NaN
3     0.52
4     0.54
5     0.54
6      NaN
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [91]:
s_1.fillna(method='bfill', limit=1)

0     0.50
1     0.50
2     0.52
3     0.52
4     0.54
5     0.54
6     0.59
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

##contadores

In [92]:
s = pd.Series(list('asdasdasedadeasdesasdes'))
s

0     a
1     s
2     d
3     a
4     s
5     d
6     a
7     s
8     e
9     d
10    a
11    d
12    e
13    a
14    s
15    d
16    e
17    s
18    a
19    s
20    d
21    e
22    s
dtype: object

In [93]:
s.unique()

array(['a', 's', 'd', 'e'], dtype=object)

In [94]:
s.value_counts()

s    7
a    6
d    6
e    4
dtype: int64

In [95]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [96]:
eventos = {'m1': list(m1), 
            'm2': list(m2), 
            'm3': list(m3), 
            'm4': list(m4), 
            'm5': list(m5)}
moedas = pd.DataFrame(eventos)
df = pd.DataFrame(data = ['Cara', 'Coroa'], 
                    index = ['c', 'C'], 
                    columns = ['Faces'])
for item in moedas:
    df = pd.concat([df, moedas[item].value_counts()], 
                    axis = 1)
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25

In [97]:
moedas

   m1 m2 m3 m4 m5
0   C  C  C  c  C
1   C  C  c  C  C
2   c  C  c  C  C
3   C  C  C  c  c
4   C  C  C  c  C
5   c  c  c  C  c
6   c  c  c  C  C
7   C  C  C  c  c
8   C  c  c  c  C
9   C  c  C  C  c
10  c  C  C  C  C
11  c  c  C  c  C
12  C  C  C  c  C
13  c  C  C  C  c
14  C  C  C  C  C
15  c  C  C  c  C
16  c  c  C  c  c
17  C  c  C  c  C
18  c  C  C  c  c
19  C  c  c  C  C
20  c  c  c  c  C
21  C  c  c  C  c
22  C  c  C  c  c
23  C  C  c  C  C
24  c  c  c  c  c
25  C  c  C  C  C
26  C  C  C  c  C
27  c  c  C  C  c
28  c  c  C  c  c
29  c  C  C  C  c
30  C  C  C  c  C
31  C  c  c  C  c
32  c  C  c  C  c
33  C  c  C  C  C
34  c  c  C  C  C
35  C  C  C  c  c
36  c  c  c  c  C
37  C  C  c  c  c
38  c  c  c  c  C
39  c  C  C  C  c
40  c  C  C  C  C
41  C  c  C  C  c
42  C  C  c  c  C
43  c  c  C  C  c
44  C  c  C  C  c
45  c  C  c  c  c
46  c  c  c  C  c
47  c  c  c  C  c
48  C  C  C  C  C
49  c  c  C  C  c